{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["CTCanalysis", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "name": "input"}, "name": "input"}, {"class_name": "ZeroPadding1D", "inbound_nodes": [[["input", 0, 0, {}]]], "config": {"dtype": "float32", "padding": [0, 310], "trainable": true, "name": "zero_padding1d_1"}, "name": "zero_padding1d_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["zero_padding1d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 7}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [5], "dilation_rate": [1], "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "filters": 200, "dtype": "float32", "use_bias": true, "name": "conv_1", "activity_regularizer": null, "bias_constraint": null}, "name": "conv_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_1"}}, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 7}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [5], "dilation_rate": [1], "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "filters": 200, "dtype": "float32", "use_bias": true, "name": "conv_2", "activity_regularizer": null, "bias_constraint": null}, "name": "conv_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_2", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_2"}}, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Conv1D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 7}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "strides": [2], "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [5], "dilation_rate": [1], "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "filters": 200, "dtype": "float32", "use_bias": true, "name": "conv_3", "activity_regularizer": null, "bias_constraint": null}, "name": "conv_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_3", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_3"}}, "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 200, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "use_bias": true, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null}}, "trainable": true, "name": "fc_0"}, "name": "fc_0"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["fc_0", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_4"}}, "trainable": true, "name": "dropout_4"}, "name": "dropout_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 200, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "use_bias": true, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null}}, "trainable": true, "name": "fc_1"}, "name": "fc_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["fc_1", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_5"}}, "trainable": true, "name": "dropout_5"}, "name": "dropout_5"}, {"class_name": "Bidirectional", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 7}}, "unit_forget_bias": true, "units": 200, "implementation": 2, "unroll": false, "return_state": false, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "name": "lstm_1", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, "trainable": true, "name": "bidirectional_1"}, "name": "bidirectional_1"}, {"class_name": "Bidirectional", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 7}}, "unit_forget_bias": true, "units": 200, "implementation": 2, "unroll": false, "return_state": false, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "name": "lstm_2", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, "trainable": true, "name": "bidirectional_2"}, "name": "bidirectional_2"}, {"class_name": "Bidirectional", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 7}}, "unit_forget_bias": true, "units": 200, "implementation": 2, "unroll": false, "return_state": false, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "name": "lstm_3", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, "trainable": true, "name": "bidirectional_3"}, "name": "bidirectional_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 200, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": 10, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "use_bias": true, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null}}, "trainable": true, "name": "fc_3"}, "name": "fc_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["fc_3", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_6"}}, "trainable": true, "name": "dropout_6"}, "name": "dropout_6"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "units": 5, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "name": "dense", "activity_regularizer": null, "bias_constraint": null}}, "trainable": true, "name": "time_distributed_1"}, "name": "time_distributed_1"}, {"class_name": "Activation", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "softmax", "trainable": true, "name": "softmax"}, "name": "softmax"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "labels"}, "name": "labels"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_length"}, "name": "input_length"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_length"}, "name": "label_length"}, {"class_name": "Lambda", "inbound_nodes": [[["softmax", 0, 0, {}], ["labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "config": {"output_shape": [null], "arguments": {"greedy": true, "beam_width": 100, "top_paths": 1}, "dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "function": ["4wEAAAAAAAAAEQAAAAkAAABLAAAAc1kBAAB8AABcBAB9AgB9AwB9BAB9BQB8AQB9BgB0AABqAQCD\nAABkAQBrAgBzMAB0AgCCAQB0AwBqBAB0AwBqBQB8AgBkAgBkAwBkBABkBQBnAwCDAQFkBgAXgwEA\nfQcAdAMAagYAdAMAagcAfAQAgwEAgwEAfQQAfAYAZAcAGX0IAHwGAGQIABl9CQB8BgBkCQAZfQoA\nfAgAcrgAdAgAagkAZAoAfAcAZAsAfAQAgwACXAIAfQsAfQwAbioAdAgAagoAZAoAfAcAZAsAfAQA\nZAgAfAkAZAkAfAoAgwAEXAIAfQsAfQwAdAMAagsAfAsAZAQAGXQDAGoMAIMCAH0NAHQAAGoNAHwD\nAHQDAGoLAHQDAGoHAHwFAIMBAHQDAGoOAIMCAIMCAH0OAHQPAHwNAHwOAGQMAGQNAIMCAX0PAHQQ\nAHwPAIMBAH0QAHQAAGoLAHwQAGQOAGQPAIMBAVMpEOEnAQAACiAgICAgICAgQ29tcGxldGUgQ1RD\nIGFuYWx5c2lzIHVzaW5nIEtlcmFzIGFuZCB0ZW5zb3JmbG93CiAgICAgICAgV0FSTklORyA6IHRm\nIGlzIHJlcXVpcmVkIAogICAgICAgIDpwYXJhbSBhcmdzOiAKICAgICAgICAgICAgeV9wcmVkLCBs\nYWJlbHMsIGlucHV0X2xlbmd0aCwgbGFiZWxfbGVuCiAgICAgICAgOnBhcmFtIGFyZ3VtZW50czoK\nICAgICAgICAgICAgZ3JlZWR5LCBiZWFtX3dpZHRoLCB0b3BfcGF0aHMKICAgICAgICA6cmV0dXJu\nOiAKICAgICAgICAgICAgbGVyID0gbGFiZWwgZXJyb3IgcmF0ZQogICAgICAgINoKdGVuc29yZmxv\nd9oEcGVybekBAAAA6QAAAADpAgAAAGc6jDDijnlFPtoGZ3JlZWR52gpiZWFtX3dpZHRo2gl0b3Bf\ncGF0aHPaBmlucHV0c9oPc2VxdWVuY2VfbGVuZ3Ro2gRub3JtVNoFZHR5cGXaB2Zsb2F0MzIpEdoB\nS9oHYmFja2VuZNoOQXNzZXJ0aW9uRXJyb3LaAnRm2gNsb2faCXRyYW5zcG9zZdoIdG9faW50MzLa\nB3NxdWVlemXaA2N0Y9oSY3RjX2dyZWVkeV9kZWNvZGVy2hdjdGNfYmVhbV9zZWFyY2hfZGVjb2Rl\nctoEY2FzdHIOAAAA2hljdGNfbGFiZWxfZGVuc2VfdG9fc3BhcnNl2gVpbnQzMtoQdGZfZWRpdF9k\naXN0YW5jZdoNS3Jlc2hhcGVfVG8xRCkR2gRhcmdz2glhcmd1bWVudHPaBnlfcHJlZNoGbGFiZWxz\n2gxpbnB1dF9sZW5ndGjaCWxhYmVsX2xlbtoJbXlfcGFyYW1z2gViYXRjaHIHAAAAcggAAAByCQAA\nANoHZGVjb2RlZNoIbG9nX3Byb2JaDGNhc3RfZGVjb2RlZFoIc3BhcnNlX3laCWVkX3RlbnNvcloL\nbGVyX3Blcl9zZXGpAHIpAAAA+g8vdGYvQ1RDTW9kZWwucHnaIWN0Y19jb21wbGV0ZV9hbmFseXNp\nc19sYW1iZGFfZnVuY2QDAABzKAAAAAAPEgEGAhgCKwEYAgoBCgEKAgYBCQEGARICCQEMARUCGQIq\nARUBDAI=\n", null, null], "trainable": true, "name": "CTCanalysis"}, "name": "CTCanalysis"}], "input_layers": [["input", 0, 0], ["labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "name": "model_4"}, "keras_version": "2.3.1"}