{"class_name": "Model", "keras_version": "2.3.1", "backend": "tensorflow", "config": {"output_layers": [["CTCanalysis", 0, 0]], "input_layers": [["input", 0, 0], ["labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "name": "model_4", "layers": [{"class_name": "InputLayer", "name": "input", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, 1], "name": "input", "dtype": "float32", "sparse": false}}, {"class_name": "Masking", "name": "masking_1", "inbound_nodes": [[["input", 0, 0, {}]]], "config": {"name": "masking_1", "trainable": true, "dtype": "float32", "mask_value": 100}}, {"class_name": "GaussianNoise", "name": "gaussian_noise_1", "inbound_nodes": [[["masking_1", 0, 0, {}]]], "config": {"stddev": 0.01, "name": "gaussian_noise_1", "trainable": true, "dtype": "float32"}}, {"class_name": "TimeDistributed", "name": "fc_0", "inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "config": {"dtype": "float32", "name": "fc_0", "trainable": true, "layer": {"class_name": "Dense", "config": {"dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": 8}}, "name": "dense_1", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": 8}}, "units": 300, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}}}, {"class_name": "TimeDistributed", "name": "dropout_0", "inbound_nodes": [[["fc_0", 0, 0, {}]]], "config": {"dtype": "float32", "name": "dropout_0", "trainable": true, "layer": {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.2, "trainable": true, "dtype": "float32"}}}}, {"class_name": "TimeDistributed", "name": "fc_1", "inbound_nodes": [[["dropout_0", 0, 0, {}]]], "config": {"dtype": "float32", "name": "fc_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": 8}}, "name": "dense_2", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": 8}}, "units": 300, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}}}, {"class_name": "TimeDistributed", "name": "dropout_1", "inbound_nodes": [[["fc_1", 0, 0, {}]]], "config": {"dtype": "float32", "name": "dropout_1", "trainable": true, "layer": {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.2, "trainable": true, "dtype": "float32"}}}}, {"class_name": "Bidirectional", "name": "bidirectional_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "implementation": 2, "go_backwards": false, "activation": "tanh", "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "unroll": false, "use_bias": true, "dropout": 0.2, "bias_regularizer": null, "dtype": "float32", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 5}}, "name": "lstm_1", "stateful": false, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 300, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_1", "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "name": "bidirectional_2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "implementation": 2, "go_backwards": false, "activation": "tanh", "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "unroll": false, "use_bias": true, "dropout": 0.2, "bias_regularizer": null, "dtype": "float32", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 5}}, "name": "lstm_2", "stateful": false, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 300, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_2", "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "name": "bidirectional_3", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "config": {"layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "implementation": 2, "go_backwards": false, "activation": "tanh", "recurrent_activation": "sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_constraint": null, "unroll": false, "use_bias": true, "dropout": 0.2, "bias_regularizer": null, "dtype": "float32", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 5}}, "name": "lstm_3", "stateful": false, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 300, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_3", "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "name": "fc_3", "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]], "config": {"dtype": "float32", "name": "fc_3", "trainable": true, "layer": {"class_name": "Dense", "config": {"dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": 8}}, "name": "dense_3", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": 8}}, "units": 300, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}}}, {"class_name": "TimeDistributed", "name": "dropout_3", "inbound_nodes": [[["fc_3", 0, 0, {}]]], "config": {"dtype": "float32", "name": "dropout_3", "trainable": true, "layer": {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "rate": 0.2, "trainable": true, "dtype": "float32"}}}}, {"class_name": "TimeDistributed", "name": "time_distributed_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"dtype": "float32", "name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}}}, {"class_name": "Activation", "name": "softmax", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"dtype": "float32", "name": "softmax", "trainable": true, "activation": "softmax"}}, {"class_name": "InputLayer", "name": "labels", "inbound_nodes": [], "config": {"batch_input_shape": [null, null], "name": "labels", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "input_length", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "name": "input_length", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "label_length", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "name": "label_length", "dtype": "float32", "sparse": false}}, {"class_name": "Lambda", "name": "CTCanalysis", "inbound_nodes": [[["softmax", 0, 0, {}], ["labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "config": {"output_shape_type": "raw", "arguments": {"top_paths": 1, "greedy": true, "beam_width": 100}, "name": "CTCanalysis", "function": ["4wEAAAAAAAAAEQAAAAkAAABLAAAAc1kBAAB8AABcBAB9AgB9AwB9BAB9BQB8AQB9BgB0AABqAQCD\nAABkAQBrAgBzMAB0AgCCAQB0AwBqBAB0AwBqBQB8AgBkAgBkAwBkBABkBQBnAwCDAQFkBgAXgwEA\nfQcAdAMAagYAdAMAagcAfAQAgwEAgwEAfQQAfAYAZAcAGX0IAHwGAGQIABl9CQB8BgBkCQAZfQoA\nfAgAcrgAdAgAagkAZAoAfAcAZAsAfAQAgwACXAIAfQsAfQwAbioAdAgAagoAZAoAfAcAZAsAfAQA\nZAgAfAkAZAkAfAoAgwAEXAIAfQsAfQwAdAMAagsAfAsAZAQAGXQDAGoMAIMCAH0NAHQAAGoNAHwD\nAHQDAGoLAHQDAGoHAHwFAIMBAHQDAGoOAIMCAIMCAH0OAHQPAHwNAHwOAGQMAGQNAIMCAX0PAHQQ\nAHwPAIMBAH0QAHQAAGoLAHwQAGQOAGQPAIMBAVMpEOEnAQAACiAgICAgICAgQ29tcGxldGUgQ1RD\nIGFuYWx5c2lzIHVzaW5nIEtlcmFzIGFuZCB0ZW5zb3JmbG93CiAgICAgICAgV0FSTklORyA6IHRm\nIGlzIHJlcXVpcmVkIAogICAgICAgIDpwYXJhbSBhcmdzOiAKICAgICAgICAgICAgeV9wcmVkLCBs\nYWJlbHMsIGlucHV0X2xlbmd0aCwgbGFiZWxfbGVuCiAgICAgICAgOnBhcmFtIGFyZ3VtZW50czoK\nICAgICAgICAgICAgZ3JlZWR5LCBiZWFtX3dpZHRoLCB0b3BfcGF0aHMKICAgICAgICA6cmV0dXJu\nOiAKICAgICAgICAgICAgbGVyID0gbGFiZWwgZXJyb3IgcmF0ZQogICAgICAgINoKdGVuc29yZmxv\nd9oEcGVybekBAAAA6QAAAADpAgAAAGc6jDDijnlFPtoGZ3JlZWR52gpiZWFtX3dpZHRo2gl0b3Bf\ncGF0aHPaBmlucHV0c9oPc2VxdWVuY2VfbGVuZ3Ro2gRub3JtVNoFZHR5cGXaB2Zsb2F0MzIpEdoB\nS9oHYmFja2VuZNoOQXNzZXJ0aW9uRXJyb3LaAnRm2gNsb2faCXRyYW5zcG9zZdoIdG9faW50MzLa\nB3NxdWVlemXaA2N0Y9oSY3RjX2dyZWVkeV9kZWNvZGVy2hdjdGNfYmVhbV9zZWFyY2hfZGVjb2Rl\nctoEY2FzdHIOAAAA2hljdGNfbGFiZWxfZGVuc2VfdG9fc3BhcnNl2gVpbnQzMtoQdGZfZWRpdF9k\naXN0YW5jZdoNS3Jlc2hhcGVfVG8xRCkR2gRhcmdz2glhcmd1bWVudHPaBnlfcHJlZNoGbGFiZWxz\n2gxpbnB1dF9sZW5ndGjaCWxhYmVsX2xlbtoJbXlfcGFyYW1z2gViYXRjaHIHAAAAcggAAAByCQAA\nANoHZGVjb2RlZNoIbG9nX3Byb2LaDGNhc3RfZGVjb2RlZNoIc3BhcnNlX3naCWVkX3RlbnNvctoL\nbGVyX3Blcl9zZXGpAHItAAAA+g8vdGYvQ1RDTW9kZWwucHnaIWN0Y19jb21wbGV0ZV9hbmFseXNp\nc19sYW1iZGFfZnVuY2QDAABzKAAAAAAPEgEGAhgCKwEYAgoBCgEKAgYBCQEGARICCQEMARUCGQIq\nARUBDAI=\n", null, null], "function_type": "lambda", "trainable": true, "dtype": "float32", "output_shape": [null]}}]}}