{"config": {"input_layers": [["input", 0, 0], ["labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input", "sparse": false, "batch_input_shape": [null, null, 1]}, "name": "input", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dtype": "float32", "name": "fc_0", "layer": {"config": {"use_bias": true, "bias_constraint": null, "units": 256, "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}, "trainable": true}, "name": "fc_0", "inbound_nodes": [[["input", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "dropout_0", "layer": {"config": {"dtype": "float32", "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_0", "inbound_nodes": [[["fc_0", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "fc_1", "layer": {"config": {"use_bias": true, "bias_constraint": null, "units": 256, "activity_regularizer": null, "dtype": "float32", "name": "dense_2", "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}, "trainable": true}, "name": "fc_1", "inbound_nodes": [[["dropout_0", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "dropout_1", "layer": {"config": {"dtype": "float32", "name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["fc_1", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "zero_padding1d_1", "padding": [0, 310], "trainable": true}, "name": "zero_padding1d_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "ZeroPadding1D"}, {"config": {"dilation_rate": [1], "use_bias": true, "filters": 256, "bias_constraint": null, "strides": [1], "kernel_initializer": {"config": {"scale": 1.0, "seed": 8, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "conv_1", "bias_regularizer": null, "padding": "valid", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "data_format": "channels_last", "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "kernel_regularizer": null}, "name": "conv_1", "inbound_nodes": [[["zero_padding1d_1", 0, 0, {}]]], "class_name": "Conv1D"}, {"config": {"dtype": "float32", "name": "dropout_2", "layer": {"config": {"dtype": "float32", "name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dilation_rate": [1], "use_bias": true, "filters": 256, "bias_constraint": null, "strides": [1], "kernel_initializer": {"config": {"scale": 1.0, "seed": 8, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "conv_2", "bias_regularizer": null, "padding": "valid", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "data_format": "channels_last", "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "kernel_regularizer": null}, "name": "conv_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv1D"}, {"config": {"dtype": "float32", "name": "dropout_3", "layer": {"config": {"dtype": "float32", "name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_3", "inbound_nodes": [[["conv_2", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dilation_rate": [1], "use_bias": true, "filters": 256, "bias_constraint": null, "strides": [2], "kernel_initializer": {"config": {"scale": 1.0, "seed": 8, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "conv_3", "bias_regularizer": null, "padding": "valid", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "data_format": "channels_last", "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "kernel_regularizer": null}, "name": "conv_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv1D"}, {"config": {"dtype": "float32", "name": "dropout_4", "layer": {"config": {"dtype": "float32", "name": "dropout_5", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_4", "inbound_nodes": [[["conv_3", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "fc_2", "layer": {"config": {"use_bias": true, "bias_constraint": null, "units": 256, "activity_regularizer": null, "dtype": "float32", "name": "dense_3", "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}, "trainable": true}, "name": "fc_2", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "dropout_5", "layer": {"config": {"dtype": "float32", "name": "dropout_6", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_5", "inbound_nodes": [[["fc_2", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "fc_3", "layer": {"config": {"use_bias": true, "bias_constraint": null, "units": 256, "activity_regularizer": null, "dtype": "float32", "name": "dense_4", "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}, "trainable": true}, "name": "fc_3", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "dropout_6", "layer": {"config": {"dtype": "float32", "name": "dropout_7", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_6", "inbound_nodes": [[["fc_3", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "bidirectional_1", "layer": {"config": {"recurrent_activation": "sigmoid", "unit_forget_bias": true, "activation": "tanh", "bias_constraint": null, "units": 256, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": 8, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "lstm_1", "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dropout": 0.2, "return_state": false, "recurrent_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "kernel_constraint": null, "implementation": 2, "stateful": false, "use_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat", "trainable": true}, "name": "bidirectional_1", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Bidirectional"}, {"config": {"dtype": "float32", "name": "bidirectional_2", "layer": {"config": {"recurrent_activation": "sigmoid", "unit_forget_bias": true, "activation": "tanh", "bias_constraint": null, "units": 256, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": 8, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "lstm_2", "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dropout": 0.2, "return_state": false, "recurrent_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "kernel_constraint": null, "implementation": 2, "stateful": false, "use_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat", "trainable": true}, "name": "bidirectional_2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "class_name": "Bidirectional"}, {"config": {"dtype": "float32", "name": "bidirectional_3", "layer": {"config": {"recurrent_activation": "sigmoid", "unit_forget_bias": true, "activation": "tanh", "bias_constraint": null, "units": 256, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": 8, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "lstm_3", "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dropout": 0.2, "return_state": false, "recurrent_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "kernel_constraint": null, "implementation": 2, "stateful": false, "use_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat", "trainable": true}, "name": "bidirectional_3", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "class_name": "Bidirectional"}, {"config": {"dtype": "float32", "name": "fc_4", "layer": {"config": {"use_bias": true, "bias_constraint": null, "units": 256, "activity_regularizer": null, "dtype": "float32", "name": "dense_5", "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {"mean": 0.0, "seed": 15, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}, "trainable": true}, "name": "fc_4", "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "dropout_7", "layer": {"config": {"dtype": "float32", "name": "dropout_8", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, "trainable": true}, "name": "dropout_7", "inbound_nodes": [[["fc_4", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "time_distributed_1", "layer": {"config": {"use_bias": true, "bias_constraint": null, "units": 5, "activity_regularizer": null, "dtype": "float32", "name": "fc_5", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}, "trainable": true}, "name": "time_distributed_1", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "name": "softmax", "activation": "softmax", "trainable": true}, "name": "softmax", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"dtype": "float32", "name": "labels", "sparse": false, "batch_input_shape": [null, null]}, "name": "labels", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dtype": "float32", "name": "input_length", "sparse": false, "batch_input_shape": [null, 1]}, "name": "input_length", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dtype": "float32", "name": "label_length", "sparse": false, "batch_input_shape": [null, 1]}, "name": "label_length", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dtype": "float32", "name": "CTCanalysis", "output_shape_type": "raw", "function_type": "lambda", "arguments": {"greedy": true, "beam_width": 100, "top_paths": 1}, "function": ["4wEAAAAAAAAAEQAAAAkAAABLAAAAc1kBAAB8AABcBAB9AgB9AwB9BAB9BQB8AQB9BgB0AABqAQCD\nAABkAQBrAgBzMAB0AgCCAQB0AwBqBAB0AwBqBQB8AgBkAgBkAwBkBABkBQBnAwCDAQFkBgAXgwEA\nfQcAdAMAagYAdAMAagcAfAQAgwEAgwEAfQQAfAYAZAcAGX0IAHwGAGQIABl9CQB8BgBkCQAZfQoA\nfAgAcrgAdAgAagkAZAoAfAcAZAsAfAQAgwACXAIAfQsAfQwAbioAdAgAagoAZAoAfAcAZAsAfAQA\nZAgAfAkAZAkAfAoAgwAEXAIAfQsAfQwAdAMAagsAfAsAZAQAGXQDAGoMAIMCAH0NAHQAAGoNAHwD\nAHQDAGoLAHQDAGoHAHwFAIMBAHQDAGoOAIMCAIMCAH0OAHQPAHwNAHwOAGQMAGQNAIMCAX0PAHQQ\nAHwPAIMBAH0QAHQAAGoLAHwQAGQOAGQPAIMBAVMpEOEnAQAACiAgICAgICAgQ29tcGxldGUgQ1RD\nIGFuYWx5c2lzIHVzaW5nIEtlcmFzIGFuZCB0ZW5zb3JmbG93CiAgICAgICAgV0FSTklORyA6IHRm\nIGlzIHJlcXVpcmVkIAogICAgICAgIDpwYXJhbSBhcmdzOiAKICAgICAgICAgICAgeV9wcmVkLCBs\nYWJlbHMsIGlucHV0X2xlbmd0aCwgbGFiZWxfbGVuCiAgICAgICAgOnBhcmFtIGFyZ3VtZW50czoK\nICAgICAgICAgICAgZ3JlZWR5LCBiZWFtX3dpZHRoLCB0b3BfcGF0aHMKICAgICAgICA6cmV0dXJu\nOiAKICAgICAgICAgICAgbGVyID0gbGFiZWwgZXJyb3IgcmF0ZQogICAgICAgINoKdGVuc29yZmxv\nd9oEcGVybekBAAAA6QAAAADpAgAAAGc6jDDijnlFPtoGZ3JlZWR52gpiZWFtX3dpZHRo2gl0b3Bf\ncGF0aHPaBmlucHV0c9oPc2VxdWVuY2VfbGVuZ3Ro2gRub3JtVNoFZHR5cGXaB2Zsb2F0MzIpEdoB\nS9oHYmFja2VuZNoOQXNzZXJ0aW9uRXJyb3LaAnRm2gNsb2faCXRyYW5zcG9zZdoIdG9faW50MzLa\nB3NxdWVlemXaA2N0Y9oSY3RjX2dyZWVkeV9kZWNvZGVy2hdjdGNfYmVhbV9zZWFyY2hfZGVjb2Rl\nctoEY2FzdHIOAAAA2hljdGNfbGFiZWxfZGVuc2VfdG9fc3BhcnNl2gVpbnQzMtoQdGZfZWRpdF9k\naXN0YW5jZdoNS3Jlc2hhcGVfVG8xRCkR2gRhcmdz2glhcmd1bWVudHPaBnlfcHJlZNoGbGFiZWxz\n2gxpbnB1dF9sZW5ndGjaCWxhYmVsX2xlbtoJbXlfcGFyYW1z2gViYXRjaHIHAAAAcggAAAByCQAA\nANoHZGVjb2RlZNoIbG9nX3Byb2LaDGNhc3RfZGVjb2RlZNoIc3BhcnNlX3naCWVkX3RlbnNvctoL\nbGVyX3Blcl9zZXGpAHItAAAA+g8vdGYvQ1RDTW9kZWwucHnaIWN0Y19jb21wbGV0ZV9hbmFseXNp\nc19sYW1iZGFfZnVuY2QDAABzKAAAAAAPEgEGAhgCKwEYAgoBCgEKAgYBCQEGARICCQEMARUCGQIq\nARUBDAI=\n", null, null], "output_shape": [null], "trainable": true}, "name": "CTCanalysis", "inbound_nodes": [[["softmax", 0, 0, {}], ["labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "class_name": "Lambda"}], "output_layers": [["CTCanalysis", 0, 0]], "name": "model_4"}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Model"}